richlegrand/psi_esp32/psi_esp32/main/httpd_server.cpp
        // Cleanup
        delete aux;
    }
}

void WebRTCSession::handleControlMessage(const std::string& message) {
    ESP_LOGI(TAG, "Control message: %s", message.c_str());

    cJSON* json = cJSON_Parse(message.c_str());
    if (!json) {
        ESP_LOGE(TAG, "Failed to parse control message JSON");
        return;
    }

    cJSON* id_item = cJSON_GetObjectItem(json, "id");
    cJSON* prop_item = cJSON_GetObjectItem(json, "prop");
    cJSON* val_item = cJSON_GetObjectItem(json, "val");

    if (!id_item || !cJSON_IsString(id_item)) {
        ESP_LOGE(TAG, "Control message missing 'id' field");
        cJSON_Delete(json);
        return;
    }

    const char* id = id_item->valuestring;
    const char* prop = prop_item && cJSON_IsString(prop_item) ? prop_item->valuestring : "";

    ESP_LOGI(TAG, "Control: id=%s prop=%s", id, prop);

    // Handle selection start (mousedown/touchstart) - freeze video
    if (strcmp(id, "video") == 0 && strcmp(prop, "selectionStart") == 0) {
        ESP_LOGI(TAG, "Selection started - freezing video");
        if (color_tracker_ && !color_tracker_->isFrozen()) {
            color_tracker_->requestFreeze();
        }
    }

    // Handle video selection complete (normalized coordinates 0-1) - starts teaching
    if (strcmp(id, "video") == 0 && strcmp(prop, "selection") == 0) {
        if (val_item && cJSON_IsArray(val_item) && cJSON_GetArraySize(val_item) >= 4) {
            float x = (float)cJSON_GetArrayItem(val_item, 0)->valuedouble;
            float y = (float)cJSON_GetArrayItem(val_item, 1)->valuedouble;
            float w = (float)cJSON_GetArrayItem(val_item, 2)->valuedouble;
            float h = (float)cJSON_GetArrayItem(val_item, 3)->valuedouble;

            ESP_LOGI(TAG, "Video selection complete: x=%.3f y=%.3f w=%.3f h=%.3f", x, y, w, h);

            if (color_tracker_) {
                // Start teaching with selected region (frame should already be frozen)
                if (color_tracker_->startTeaching(x, y, w, h)) {
                    ESP_LOGI(TAG, "Teaching started with selection");
                } else {
                    ESP_LOGW(TAG, "Failed to start teaching - unfreezing");
                    color_tracker_->unfreeze();
                }
            }
        }
    }

    // Handle "Next" button click - iterate teaching
    if (strcmp(id, "next-btn") == 0 && strcmp(prop, "clicked") == 0) {
        ESP_LOGI(TAG, "Next button clicked - iterating teaching");
        if (color_tracker_) {
            color_tracker_->iterateTeaching();
        }
    }

    // Handle "Accept" button click - accept color model
    if (strcmp(id, "accept-btn") == 0 && strcmp(prop, "clicked") == 0) {
        ESP_LOGI(TAG, "Accept button clicked - accepting model");
        if (color_tracker_) {
            color_tracker_->acceptTeaching();
        }
    }

    // Handle "Cancel" button click - cancel teaching and unfreeze
    if (strcmp(id, "cancel-btn") == 0 && strcmp(prop, "clicked") == 0) {
        ESP_LOGI(TAG, "Cancel button clicked - cancelling teaching");
        if (color_tracker_) {
            color_tracker_->cancelTeaching();
            color_tracker_->unfreeze();
        }
    }

    cJSON_Delete(json);
}

//=============================================================================
// WebRTCServer Implementation
//=============================================================================

WebRTCServer::WebRTCServer(const std::string& uid, const std::string& server_url)
    : uid_(uid), server_url_(server_url) {
    ESP_LOGI(TAG, "WebRTCServer created for UID: %s", uid.c_str());

    // Create video streamer
    // Output: 640x360 @ 25fps
    // Camera resolution auto-detected (set via menuconfig: 1280x720 or 1920x1080)
    // PPA scaling automatically enabled if output != camera
    // CV pipeline enabled to allow ColorTracker processing
    video_streamer_ = std::make_unique<VideoStreamer>(640, 360, 25, true);

    // Create color tracker for freeze/teaching/tracking
    color_tracker_ = std::make_unique<ColorTracker>();

    // Connect ColorTracker as frame callback
    // Capture the raw pointer since VideoStreamer outlives this lambda
    ColorTracker* tracker = color_tracker_.get();
    video_streamer_->setFrameCallback([tracker](const Frame& input) {
        return tracker->onFrame(input);
    });

    ESP_LOGI(TAG, "ColorTracker callback connected to VideoStreamer");
}

WebRTCServer::~WebRTCServer() {
    stop();
}

void WebRTCServer::websocketEventHandler(void* handler_args, esp_event_base_t base,
                                          int32_t event_id, void* event_data) {
    // Configure pthread to use PSRAM for the WebSocket client's task
    // This ensures PeerConnection creation (which spawns libjuice threads) uses PSRAM stacks
    // Call this once per event to ensure config is set (it's idempotent)
    esp32_ensure_pthread_psram();

    WebRTCServer* server = static_cast<WebRTCServer*>(handler_args);
    esp_websocket_event_data_t* data = static_cast<esp_websocket_event_data_t*>(event_data);

    // Log all events for debugging
    //ESP_LOGI(TAG, "WebSocket event: %d", (int)event_id);

    switch (event_id) {
        case WEBSOCKET_EVENT_CONNECTED:
            ESP_LOGI(TAG, "WebSocket connected to signaling server");
            break;

        case WEBSOCKET_EVENT_DISCONNECTED:
        case WEBSOCKET_EVENT_CLOSED:
            ESP_LOGW(TAG, "WebSocket disconnected/closed (event %d)", (int)event_id);

            // Initiate reconnection (built-in will handle retries if it fails)
            if (server->running_ && server->ws_client_) {
                ESP_LOGI(TAG, "Attempting to reconnect...");
                // Brief delay before reconnecting (seems to help connection succeed)
                vTaskDelay(pdMS_TO_TICKS(1000));
                esp_websocket_client_start(server->ws_client_);
            }
            break;

        case WEBSOCKET_EVENT_DATA:
            if (data->op_code == 0x01 && data->data_len > 0) {  // Text frame
                // Append received data to buffer
                server->ws_message_buffer_.append((char*)data->data_ptr, data->data_len);

