richlegrand/psi_esp32/psi_esp32/main/httpd_server.cpp
    ws_client_ = esp_websocket_client_init(&websocket_cfg);
    if (!ws_client_) {
        ESP_LOGE(TAG, "Failed to initialize WebSocket client");
        return;
    }

    // Verify ping interval was set correctly
    size_t ping_interval = esp_websocket_client_get_ping_interval_sec(ws_client_);
    ESP_LOGI(TAG, "WebSocket client initialized with ping_interval=%d seconds", (int)ping_interval);

    esp_websocket_register_events(ws_client_, WEBSOCKET_EVENT_ANY, websocketEventHandler, this);
    esp_websocket_client_start(ws_client_);

    ESP_LOGI(TAG, "WebSocket client started - auto-reconnect on disconnect enabled");
}

void WebRTCServer::stop() {
    ESP_LOGI(TAG, "Stopping WebRTCServer...");

    running_ = false;

    // Clean up video streamer (will auto-stop when tracks are removed)
    if (video_streamer_) {
        video_streamer_.reset();
    }

    // Close all sessions
    {
        std::lock_guard<std::mutex> lock(sessions_mutex_);
        sessions_.clear();
        peer_connections_.clear();
    }

    // Close WebSocket
    if (ws_client_) {
        esp_websocket_client_stop(ws_client_);
        esp_websocket_client_destroy(ws_client_);
        ws_client_ = nullptr;
    }
}

//=============================================================================
// C API Implementation for httpd_resp_* functions
// These provide WebRTC DataChannel transport while maintaining ESP-IDF API
//=============================================================================

// Server context for httpd_handle_t
struct httpd_server_context {
    WebRTCServer* server;
};

extern "C" {

esp_err_t httpd_start(httpd_handle_t *handle, const httpd_config_t *config) {
    if (!handle || !config) {
        return ESP_ERR_INVALID_ARG;
    }

    // Get UID from environment or use default
    const char* uid_env = getenv("DEVICE_UID");
    std::string uid = uid_env ? uid_env : "0123456789";

    // Get server URL from environment or use default
    const char* server_env = getenv("PSI_SERVER");
    std::string server_url = server_env ? server_env : "psi.vizycam.com";

    auto ctx = new httpd_server_context();
    ctx->server = new WebRTCServer(uid, server_url);
    ctx->server->start();

    *handle = (httpd_handle_t)ctx;
    return ESP_OK;
}

esp_err_t httpd_stop(httpd_handle_t handle) {
    if (!handle) {
        return ESP_ERR_INVALID_ARG;
    }

    auto ctx = (httpd_server_context*)handle;
    ctx->server->stop();
    delete ctx->server;
    delete ctx;

    return ESP_OK;
}

esp_err_t httpd_register_uri_handler(httpd_handle_t handle, const httpd_uri_t *uri_handler) {
    if (!handle || !uri_handler) {
        return ESP_ERR_INVALID_ARG;
    }

    auto ctx = (httpd_server_context*)handle;
    return ctx->server->registerHandler(uri_handler);
}

esp_err_t httpd_unregister_uri_handler(httpd_handle_t handle, const char *uri, httpd_method_t method) {
    // TODO: implement
    return ESP_ERR_NOT_FOUND;
}

esp_err_t httpd_resp_send(httpd_req_t *r, const char *buf, ssize_t buf_len) {
    if (!r || !r->aux) {
        return ESP_ERR_INVALID_ARG;
    }

    auto aux = static_cast<httpd_req_aux*>(r->aux);

    // Handle HTTPD_RESP_USE_STRLEN
    size_t actual_len = (buf_len == HTTPD_RESP_USE_STRLEN) ? strlen(buf) : buf_len;

    // Build metadata JSON
    cJSON* metadata = cJSON_CreateObject();
    cJSON_AddNumberToObject(metadata, "status", aux->status_code);

    cJSON* headers = cJSON_CreateObject();
    cJSON_AddStringToObject(headers, "Content-Type", aux->content_type.c_str());
    cJSON_AddStringToObject(headers, "Content-Length", std::to_string(actual_len).c_str());

    // Add custom headers
    for (const auto& [key, value] : aux->response_headers) {
        cJSON_AddStringToObject(headers, key.c_str(), value.c_str());
    }
    cJSON_AddItemToObject(metadata, "headers", headers);

    char* metadata_str = cJSON_PrintUnformatted(metadata);
    if (metadata_str) {
        // Send metadata frame
        aux->session->sendSwspFrame(aux->stream_id, FLAG_SYN, std::string(metadata_str));
        free(metadata_str);
    }
    cJSON_Delete(metadata);

    // Send body in chunks (max 65535 bytes per frame due to uint16_t length field)
    const size_t MAX_CHUNK_SIZE = 65535;
    size_t offset = 0;

    while (offset < actual_len) {
        size_t chunk_size = std::min(MAX_CHUNK_SIZE, actual_len - offset);
        std::vector<uint8_t> chunk_data(buf + offset, buf + offset + chunk_size);

        // Last chunk gets FLAG_FIN, others get no flags
        uint16_t flags = (offset + chunk_size >= actual_len) ? FLAG_FIN : 0;
        aux->session->sendSwspFrame(aux->stream_id, flags, chunk_data);

        offset += chunk_size;
    }

    return ESP_OK;
}

esp_err_t httpd_resp_send_chunk(httpd_req_t *r, const char *buf, ssize_t buf_len) {
    if (!r || !r->aux) {
        return ESP_ERR_INVALID_ARG;
    }

    auto aux = static_cast<httpd_req_aux*>(r->aux);

    // First call: send metadata if not sent yet
    if (!aux->headers_sent) {
        cJSON* metadata = cJSON_CreateObject();
        cJSON_AddNumberToObject(metadata, "status", aux->status_code);

        cJSON* headers = cJSON_CreateObject();
        cJSON_AddStringToObject(headers, "Content-Type", aux->content_type.c_str());
        // Note: No Content-Length for chunked responses

        for (const auto& [key, value] : aux->response_headers) {
            cJSON_AddStringToObject(headers, key.c_str(), value.c_str());
        }
        cJSON_AddItemToObject(metadata, "headers", headers);

        char* metadata_str = cJSON_PrintUnformatted(metadata);
        if (metadata_str) {
            aux->session->sendSwspFrame(aux->stream_id, FLAG_SYN, std::string(metadata_str));
            free(metadata_str);
        }
        cJSON_Delete(metadata);
        aux->headers_sent = true;
    }

    // NULL or 0 length = end of chunks
    if (!buf || buf_len == 0) {
        std::vector<uint8_t> empty;
        aux->session->sendSwspFrame(aux->stream_id, FLAG_FIN, empty);
        return ESP_OK;
    }

    // Handle HTTPD_RESP_USE_STRLEN
    size_t actual_len = (buf_len == HTTPD_RESP_USE_STRLEN) ? strlen(buf) : buf_len;

    // Send data in chunks
    const size_t MAX_CHUNK_SIZE = 65535;
    size_t offset = 0;

    while (offset < actual_len) {
        size_t chunk_size = std::min(MAX_CHUNK_SIZE, actual_len - offset);
        std::vector<uint8_t> chunk_data(buf + offset, buf + offset + chunk_size);

        // Send chunk with no flags (not FIN yet)
        aux->session->sendSwspFrame(aux->stream_id, 0, chunk_data);

        offset += chunk_size;
    }

    return ESP_OK;
}

esp_err_t httpd_resp_set_status(httpd_req_t *r, const char *status) {
    if (!r || !r->aux || !status) {
        return ESP_ERR_INVALID_ARG;
    }

    auto aux = static_cast<httpd_req_aux*>(r->aux);
    aux->status_str = status;
    aux->status_code = atoi(status);

    return ESP_OK;
}

esp_err_t httpd_resp_set_type(httpd_req_t *r, const char *type) {
    if (!r || !r->aux || !type) {
        return ESP_ERR_INVALID_ARG;
    }

    auto aux = static_cast<httpd_req_aux*>(r->aux);
    aux->content_type = type;

    return ESP_OK;
}

esp_err_t httpd_resp_set_hdr(httpd_req_t *r, const char *field, const char *value) {
    if (!r || !r->aux || !field || !value) {
        return ESP_ERR_INVALID_ARG;
    }

    auto aux = static_cast<httpd_req_aux*>(r->aux);
    aux->response_headers[field] = value;

    return ESP_OK;
}

esp_err_t httpd_resp_send_err(httpd_req_t *r, httpd_err_code_t error, const char *msg) {
    if (!r) {
        return ESP_ERR_INVALID_ARG;
    }

    const char* status_map[] = {
        "500 Internal Server Error",
        "501 Not Implemented",
        "505 Version Not Supported",
        "400 Bad Request",
        "401 Unauthorized",
        "403 Forbidden",
        "404 Not Found",
        "405 Method Not Allowed",
        "408 Request Timeout",
        "411 Length Required",
        "413 Content Too Large",
        "414 URI Too Long",
        "431 Request Header Fields Too Large"
    };

    const char* status = (error < HTTPD_ERR_CODE_MAX) ? status_map[error] : "500 Internal Server Error";

    httpd_resp_set_status(r, status);
    httpd_resp_set_type(r, "text/plain");

    const char* error_msg = msg ? msg : status;
    return httpd_resp_send(r, error_msg, strlen(error_msg));
}

// Stub implementations for other ESP-IDF httpd functions
size_t httpd_req_get_hdr_value_len(httpd_req_t *r, const char *field) {
    if (!r || !r->aux || !field) {
        return 0;
    }
    auto aux = static_cast<httpd_req_aux*>(r->aux);
    auto it = aux->headers.find(field);
    if (it != aux->headers.end()) {
        return it->second.length();
    }
    return 0;
}

